Documents/ВводНачальныхОстатковВыданныхСИЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатковВыданныхСИЗ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ВыдачиСИЗПоНоменклатуре</xr:Item>
				<xr:Item>AccumulationRegister.ВыданныеСИЗ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>// АПК:58 Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСИЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СИЗ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>АПК:58</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Сумма в валюте взаиморасчетов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующейВыдачи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дежурное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КратностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодичностьВыдачи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПериодичностиВыдачи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Размеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПодразделения</Name>
							<Comment>Требуется для загрузки данных из файла</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СредстваИндивидуальнойЗащиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СредстваИндивидуальнойЗащиты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>АПК:58 особенность именования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецХарактеристик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВводНачальныхОстатковВыданныхСИЗ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(ФизическиеЛица.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

// Переопределяет параметры загрузки данных из файла.
//
// Параметры:
//  Параметры - Структура:
//   * ИмяМакетаСШаблоном - Строка - наименование макета. Например, "ЗагрузкаИзФайла".
//   * ИмяТабличнойЧасти - Строка - Полное имя табличной части. Например, "Документ._ДемоСчетНаОплатуПокупателю.ТабличнаяЧасть.Товары"
//   * ОбязательныеКолонки - Массив из Строка - наименования обязательных для заполнения колонок.
//   * ТипДанныхКолонки - Соответствие из КлючИЗначение:
//      * Ключ - Строка - имя колонки;
//      * Значение - ОписаниеТипов - тип колонки загружаемых данных.
//   * ДополнительныеПараметры - Структура
//
Процедура УстановитьПараметрыЗагрузкиИзФайлаВТЧ(Параметры) Экспорт

КонецПроцедуры

// Производит сопоставление данных, загружаемых в табличную часть ПолноеИмяТабличнойЧасти,
// с данными в ИБ, и заполняет параметры АдресТаблицыСопоставления и СписокНеоднозначностей.
//
// Параметры:
//   АдресЗагружаемыхДанных    - Строка - адрес временного хранилища с таблицей значений, в которой
//                               находятся загруженные данные из файла. Состав колонок:
//     * Идентификатор - Число - порядковый номер строки;
//     * остальные колонки соответствуют колонкам макета ЗагрузкаИзФайла.
//   АдресТаблицыСопоставления - Строка - адрес временного хранилища с пустой таблицей значений,
//                               являющейся копией табличной части документа, 
//                                        которую необходимо заполнить из таблицы АдресЗагружаемыхДанных.
//   СписокНеоднозначностей - ТаблицаЗначений - список неоднозначных значений, для которых в ИБ имеется несколько подходящих вариантов.
//       * Колонка       - Строка - имя колонки, в которой была обнаружена неоднозначность;
//       * Идентификатор - Число  - идентификатор строки, в которой была обнаружена неоднозначность.
//   ПолноеИмяТабличнойЧасти   - Строка - полное имя табличной части, в которую загружаются данные.
//   ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения.
//
Процедура СопоставитьЗагружаемыеДанные(АдресЗагружаемыхДанных, АдресТаблицыСопоставления, СписокНеоднозначностей,
		ПолноеИмяТабличнойЧасти, ДополнительныеПараметры) Экспорт
	
	ТаблицаСопоставления = ПолучитьИзВременногоХранилища(АдресТаблицыСопоставления);
	ЗагружаемыеДанные = ПолучитьИзВременногоХранилища(АдресЗагружаемыхДанных);
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КадровыйУчет.СоздатьВТФизическиеЛицаРаботавшиеВОрганизации(МенеджерВременныхТаблиц, Истина, ДополнительныеПараметры.Организация,
		ДополнительныеПараметры.ДатаДокумента, ДополнительныеПараметры.ДатаДокумента, ДополнительныеПараметры.Подразделение);
	
	Запрос.УстановитьПараметр("МассивФизическихЛиц", ВыгрузитьКолонку(ЗагружаемыеДанные, "ФизическоеЛицо"));
	Запрос.УстановитьПараметр("МассивКодовПодразделений", ВыгрузитьКолонку(ЗагружаемыеДанные, "КодПодразделения"));
	Запрос.УстановитьПараметр("МассивСИЗ", ВыгрузитьКолонку(ЗагружаемыеДанные, "СИЗ"));
	Запрос.УстановитьПараметр("МассивНоменклатуры", ВыгрузитьКолонку(ЗагружаемыеДанные, "Номенклатура"));
	Запрос.УстановитьПараметр("МассивДолжностей", ВыгрузитьКолонку(ЗагружаемыеДанные, "Должность"));
	Запрос.УстановитьПараметр("МассивЕдиницИзмерения", ВыгрузитьКолонку(ЗагружаемыеДанные, "ЕдиницаИзмерения"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.ФизическоеЛицо КАК Ссылка,
		|	ФизическиеЛица.ФизическоеЛицо.Код КАК КодФизическогоЛица,
		|	ФизическиеЛица.ФизическоеЛицо.Наименование КАК ФизическоеЛицо
		|ИЗ
		|	ВТФизическиеЛицаРаботавшиеВОрганизации КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.ФизическоеЛицо.Наименование В (&МассивФизическихЛиц)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СИЗ.Ссылка КАК Ссылка,
		|	СИЗ.Наименование КАК СИЗ,
		|	СИЗ.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.СредстваИндивидуальнойЗащиты КАК СИЗ
		|ГДЕ
		|	СИЗ.Наименование В (&МассивСИЗ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправочникНоменклатура.Ссылка КАК Ссылка,
		|	СправочникНоменклатура.Наименование КАК Номенклатура,
		|	СправочникНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК СправочникНоменклатура
		|ГДЕ
		|	СправочникНоменклатура.Наименование В (&МассивНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК Ссылка,
		|	ПодразделенияОрганизаций.Код КАК КодПодразделения,
		|	ПодразделенияОрганизаций.Наименование КАК Подразделение,
		|	ПодразделенияОрганизаций.Владелец.Наименование КАК Организация
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.Код В (&МассивКодовПодразделений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Должности.Ссылка КАК Ссылка,
		|	Должности.Наименование КАК Должность
		|ИЗ
		|	Справочник.Должности КАК Должности
		|ГДЕ
		|	Должности.Наименование В (&МассивДолжностей);
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка,
		|	ЕдиницыИзмерения.Наименование КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Наименование В (&МассивЕдиницИзмерения)";
	
	РезультатыЗапросов = Запрос.ВыполнитьПакет();
	
	РезультатЗагрузки = Новый Структура;
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[0].Выгрузить(), "ТаблицаФизическиеЛица", "ФизическоеЛицо");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[1].Выгрузить(), "ТаблицаСИЗ", "СИЗ");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[2].Выгрузить(), "ТаблицаНоменклатура", "Номенклатура");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[3].Выгрузить(), "ТаблицаКодыПодразделений", "КодПодразделения");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[4].Выгрузить(), "ТаблицаДолжности", "Должность");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатыЗапросов[5].Выгрузить(), "ТаблицаЕдиницИзмерения", "ЕдиницаИзмерения");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатЗагрузки.ТаблицаФизическиеЛица.Скопировать(), "ТаблицаФизическиеЛицаКодыФизическихЛиц", "ФизическоеЛицо, КодФизическогоЛица");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатЗагрузки.ТаблицаСИЗ.Скопировать(), "ТаблицаСИЗВидНоменклатуры", "СИЗ, ВидНоменклатуры");
	СохранитьПроиндексированныйРезультат(РезультатЗагрузки, РезультатЗагрузки.ТаблицаКодыПодразделений.Скопировать(), "ТаблицаОрганизацийКодыПодразделений", "Организация, КодПодразделения");
	
	КэшДанныхЗагрузки = Новый Структура;
	КэшДанныхЗагрузки.Вставить("СоответствиеСтрокДатам", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеФизическихЛицПоОтбору", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеФизическихЛиц", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеКодовПодразделений", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеСИЗ", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеНоменклатуры", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеДолжностей", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеЕдиницИзмерения", Новый Соответствие);
	КэшДанныхЗагрузки.Вставить("СоответствиеПодразделенийПоОтбору", Новый Соответствие);
	
	ПустаяДата = Дата(1,1,1);
	Для Каждого СтрокаТаблицы Из ЗагружаемыеДанные Цикл
		НоваяСтрока = ТаблицаСопоставления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		Если НоваяСтрока.ДатаВыдачи = ПустаяДата Тогда
			ЗаполнитьПериодИзСтрокиВДату(
				НоваяСтрока, КэшДанныхЗагрузки.СоответствиеСтрокДатам, СтрокаТаблицы.ДатаВыдачи, "ДатаВыдачи");
		КонецЕсли;
		Если НоваяСтрока.ДатаСледующейВыдачи = ПустаяДата Тогда
			ЗаполнитьПериодИзСтрокиВДату(
				НоваяСтрока, КэшДанныхЗагрузки.СоответствиеСтрокДатам, СтрокаТаблицы.ДатаСледующейВыдачи, "ДатаСледующейВыдачи");
		КонецЕсли;
		ПроверитьНеоднозначностьФизическогоЛица(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
		ПроверитьНеоднозначностьПодразделения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
		ПроверитьНеоднозначностьСИЗ(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
		ПроверитьНеоднозначностьНоменклатуры(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
		ПроверитьНеоднозначностьДолжностей(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
		ПроверитьНеоднозначностьЕдиницИзмерения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки);
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставления, АдресТаблицыСопоставления);
	
КонецПроцедуры

// Возвращает список подходящих объектов ИБ для неоднозначного значения ячейки.
// 
// Параметры:
//    ПолноеИмяТабличнойЧасти  - Строка - Полное имя табличной части, в которую загружаются данные.
//    ИмяКолонки               - Строка - Имя колонки, в который возникла неоднозначность. 
//    СписокНеоднозначностей    - Массив  - Массив для заполнения с неоднозначными данными.
//    ЗагружаемыеЗначенияСтрока - Строка  - Загружаемые данные, на основании которых возникла неоднозначность.
//    ДополнительныеПараметры   - ЛюбойТип - Любые дополнительные сведения
//
Процедура ЗаполнитьСписокНеоднозначностей(ПолноеИмяТабличнойЧасти, СписокНеоднозначностей, ИмяКолонки, ЗагружаемыеЗначенияСтрока, ДополнительныеПараметры) Экспорт
	
	Если ИмяКолонки = "ФизическоеЛицо" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.ФизическоеЛицо);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);  
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "СИЗ" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СИЗ.Ссылка
			|ИЗ
			|	Справочник.СредстваИндивидуальнойЗащиты КАК СИЗ
			|ГДЕ
			|	СИЗ.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.СИЗ);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "Номенклатура" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "Должность" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Должности.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Должности КАК Должности
			|ГДЕ
			|	Должности.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Должность);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "Подразделение" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Подразделения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.ПодразделенияОрганизаций КАК Подразделения
			|ГДЕ
			|	Подразделения.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.Подразделение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ИмяКолонки = "ЕдиницаИзмерения" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕдиницыИзмерения.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КлассификаторЕдиницИзмерения КАК ЕдиницыИзмерения
			|ГДЕ
			|	ЕдиницыИзмерения.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", ЗагружаемыеЗначенияСтрока.ЕдиницаИзмерения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СписокНеоднозначностей.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзФайла

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОхранаТрудаКлиентСервер.ЗаполнитьПредставлениеДокумента(Данные, Представление, НСтр("ru = 'Ввод остатков СИЗ'"));
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОтбораПоОрганизации(Настройки, , "ОхранаТруда");
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляОбъектаСПрисоединеннымиФайлами(Настройки);
КонецПроцедуры

#КонецОбласти

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаОбъекта.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ВводНачальныхОстатковВыданныхСИЗ;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

// Формирует печатные формы
//
// Параметры:
//  (входные)
//    МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//    ПараметрыПечати - Структура - дополнительные настройки печати;
//  (выходные)
//   КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы
//   ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                             представление - имя области в которой был выведен объект;
//   ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаДанныхИзФайла

Функция ВыгрузитьКолонку(ЗагружаемыеДанные, ИмяКолонки)
	
	Таблица = ЗагружаемыеДанные.Скопировать();
	Таблица.Свернуть(ИмяКолонки);
	
	Возврат Таблица.ВыгрузитьКолонку(ИмяКолонки);

КонецФункции

Процедура ЗаполнитьПериодИзСтрокиВДату(НоваяСтрока, СоответствиеСтрокДатам, СтрокаПериод, ИмяПоля)
	
	Период = СоответствиеСтрокДатам.Получить(СтрокаПериод);
	
	Если Период = Неопределено Тогда
		Период = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаПериод);
		СоответствиеСтрокДатам.Вставить(СтрокаПериод, Период);
	КонецЕсли;
	
	НоваяСтрока[ИмяПоля] = Период;
	
	Если ИмяПоля <> "ДатаСледующейВыдачи" И ЗначениеЗаполнено(Период) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеПериодичности = СредстваИндивидуальнойЗащиты.ОписаниеПериодичностиВыдачи();
	ЗаполнитьЗначенияСвойств(ОписаниеПериодичности, НоваяСтрока);
	ОписаниеПериодичности.Кратность = НоваяСтрока.КратностьВыдачи;
	ОписаниеПериодичности.Периодичность = НоваяСтрока.ПериодичностьВыдачи;
	ОписаниеПериодичности.ЕдиницаПериодичности = НоваяСтрока.ЕдиницаПериодичностиВыдачи;
	НоваяСтрока.ДатаСледующейВыдачи =
		СредстваИндивидуальнойЗащиты.ДатаСледующейВыдачи(НоваяСтрока.ДатаВыдачи, ОписаниеПериодичности);
	
КонецПроцедуры

Процедура ПроверитьНеоднозначностьФизическогоЛица(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	Если Не ПустаяСтрока(СтрокаТаблицы.ФизическоеЛицо) Тогда
		НоваяСтрока.ФизическоеЛицо = КэшДанныхЗагрузки.СоответствиеФизическихЛиц.Получить(СтрокаТаблицы.ФизическоеЛицо);
		Если Не ЗначениеЗаполнено(НоваяСтрока.ФизическоеЛицо) Тогда
			Отбор = Новый Структура("ФизическоеЛицо", СтрокаТаблицы.ФизическоеЛицо);
			Строки = РезультатЗагрузки.ТаблицаФизическиеЛица.НайтиСтроки(Отбор);
			Если Строки.Количество() = 1 Тогда 
				НоваяСтрока.ФизическоеЛицо = Строки[0].Ссылка;
				КэшДанныхЗагрузки.СоответствиеФизическихЛиц.Вставить(СтрокаТаблицы.ФизическоеЛицо, НоваяСтрока.ФизическоеЛицо);
				Возврат;
			ИначеЕсли Строки.Количество() > 1 Тогда
				ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
				ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
				ЗаписьОНеоднозначности.Колонка = "ФизическоеЛицо";
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНеоднозначностьПодразделения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	Если ПустаяСтрока(СтрокаТаблицы.КодПодразделения) Тогда
		Возврат;
	КонецЕсли;
	Если Не ПустаяСтрока(СтрокаТаблицы.Организация) Тогда
		Отбор = Новый Структура("Организация, КодПодразделения", СтрокаТаблицы.Организация, СтрокаТаблицы.КодПодразделения);
		НоваяСтрока.Подразделение = КэшДанныхЗагрузки.СоответствиеПодразделенийПоОтбору.Получить(Отбор);
		Если ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			Возврат;
		КонецЕсли;
		Строки = РезультатЗагрузки.ТаблицаОрганизацийКодыПодразделений.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Подразделение = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеПодразделенийПоОтбору.Вставить(Отбор, НоваяСтрока.Подразделение);
			КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Вставить(СтрокаТаблицы.КодПодразделения, НоваяСтрока.Подразделение);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Подразделение";
		КонецЕсли;
	Иначе
		НоваяСтрока.Подразделение = КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Получить(СтрокаТаблицы.КодПодразделения);
		Если ЗначениеЗаполнено(НоваяСтрока.Подразделение) Тогда
			Возврат;
		КонецЕсли;
		Отбор = Новый Структура("КодПодразделения", СтрокаТаблицы.КодПодразделения);
		Строки = РезультатЗагрузки.ТаблицаКодыПодразделений.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Подразделение = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеКодовПодразделений.Вставить(СтрокаТаблицы.КодПодразделения, НоваяСтрока.Подразделение);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Подразделение";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНеоднозначностьСИЗ(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	НоваяСтрока.СИЗ = КэшДанныхЗагрузки.СоответствиеСИЗ.Получить(СтрокаТаблицы.СИЗ);
	Если Не ЗначениеЗаполнено(НоваяСтрока.СИЗ) Тогда
		Отбор = Новый Структура("СИЗ", СтрокаТаблицы.СИЗ);
		Строки = РезультатЗагрузки.ТаблицаСИЗ.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.СИЗ = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеСИЗ.Вставить(СтрокаТаблицы.СИЗ, НоваяСтрока.СИЗ);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "СИЗ";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНеоднозначностьНоменклатуры(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	НоваяСтрока.Номенклатура = КэшДанныхЗагрузки.СоответствиеНоменклатуры.Получить(СтрокаТаблицы.Номенклатура);
	Если Не ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
		Отбор = Новый Структура("Номенклатура", СтрокаТаблицы.Номенклатура);
		Строки = РезультатЗагрузки.ТаблицаНоменклатура.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Номенклатура = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеНоменклатуры.Вставить(СтрокаТаблицы.Номенклатура, НоваяСтрока.Номенклатура);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Номенклатура";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНеоднозначностьДолжностей(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	НоваяСтрока.Должность = КэшДанныхЗагрузки.СоответствиеДолжностей.Получить(СтрокаТаблицы.Должность);
	Если Не ЗначениеЗаполнено(НоваяСтрока.Должность) Тогда
		Отбор = Новый Структура("Должность", СтрокаТаблицы.Должность);
		Строки = РезультатЗагрузки.ТаблицаДолжности.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.Должность = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеДолжностей.Вставить(СтрокаТаблицы.Должность, НоваяСтрока.Должность);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "Должность";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНеоднозначностьЕдиницИзмерения(НоваяСтрока, СтрокаТаблицы, КэшДанныхЗагрузки, СписокНеоднозначностей, РезультатЗагрузки)
	
	НоваяСтрока.ЕдиницаИзмерения = КэшДанныхЗагрузки.СоответствиеЕдиницИзмерения.Получить(СтрокаТаблицы.ЕдиницаИзмерения);
	Если Не ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
		Отбор = Новый Структура("ЕдиницаИзмерения", СтрокаТаблицы.ЕдиницаИзмерения);
		Строки = РезультатЗагрузки.ТаблицаЕдиницИзмерения.НайтиСтроки(Отбор);
		Если Строки.Количество() = 1 Тогда 
			НоваяСтрока.ЕдиницаИзмерения = Строки[0].Ссылка;
			КэшДанныхЗагрузки.СоответствиеЕдиницИзмерения.Вставить(СтрокаТаблицы.ЕдиницаИзмерения, НоваяСтрока.ЕдиницаИзмерения);
		ИначеЕсли Строки.Количество() > 1 Тогда
			ЗаписьОНеоднозначности = СписокНеоднозначностей.Добавить();
			ЗаписьОНеоднозначности.Идентификатор = СтрокаТаблицы.Идентификатор; 
			ЗаписьОНеоднозначности.Колонка = "ЕдиницаИзмерения";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) И ЗначениеЗаполнено(НоваяСтрока.СИЗ) Тогда
			НоваяСтрока.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.СИЗ, "ЕдиницаИзмерения");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьПроиндексированныйРезультат(РезультатЗагрузки, ТаблицаВыгрузки, ИмяТаблицы, Колонки)
	
	ОбщегоНазначенияБЗК.ДобавитьИндексКоллекции(ТаблицаВыгрузки, Колонки);
	РезультатЗагрузки.Вставить(ИмяТаблицы, ТаблицаВыгрузки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
